Repository: NoCoDeer/calculator-framework
Catalog: languages/calculator-framework-*.po
Languages: ru_ru

source: Calculator Framework Settings
ru_ru: Настройки фреймворка калькуляторов

source: Total
ru_ru: Итого

source: Calculators
ru_ru: Калькуляторы

source: Compound Interest Calculator
ru_ru: Калькулятор сложных процентов

source: Savings Calculator
ru_ru: Калькулятор сбережений

source: Initial Investment
ru_ru: Начальная сумма вклада

source: Annual Interest Rate (%)
ru_ru: Годовая процентная ставка (%)

source: Time (Years)
ru_ru: Срок вклада (лет)

source: Compounding Frequency
ru_ru: Периодичность начисления

source: Yearly
ru_ru: Раз в год

source: Quarterly
ru_ru: Раз в квартал

source: Monthly
ru_ru: Раз в месяц

source: Replenishment Frequency
ru_ru: Периодичность пополнения

source: No Replenishment
ru_ru: Без пополнения

source: Replenishment Amount
ru_ru: Сумма пополнения

source: Monthly Deposit
ru_ru: Ежемесячный взнос

source: Calculate
ru_ru: Рассчитать

source: Reset
ru_ru: Сбросить

source: Amount and Term
ru_ru: Сумма и срок

source: Capital Growth Chart
ru_ru: График роста капитала

source: Calculation Table
ru_ru: Таблица расчета

source: Year
ru_ru: Год

source: Your Investment
ru_ru: Ваши вложения

source: Total Interest
ru_ru: Общий процент

source: Final Balance
ru_ru: Итоговый баланс

source: Hide Title
ru_ru: Скрыть заголовок

source: Please enter valid positive numbers for all fields.
ru_ru: Пожалуйста, введите корректные положительные числа во все поля.

source: Error
ru_ru: Ошибка

source: Calculation failed.
ru_ru: Расчет не удался.

source: An error occurred while processing your request. Please try again.
ru_ru: Произошла ошибка при обработке вашего запроса. Пожалуйста, попробуйте снова.

source: Principal
ru_ru: Основной капитал

source: Total Income
ru_ru: Общий доход

source: Years
ru_ru: Годы

source: Amount
ru_ru: Сумма

source: No calculator modules are available.
ru_ru: Нет доступных модулей калькуляторов.

source: Enable Calculator
ru_ru: Включить калькулятор

source: Chart Colors
ru_ru: Цвета диаграмм

source: Principal Color
ru_ru: Цвет основного капитала

source: Interest Color
ru_ru: Цвет процентов

source: Total Color
ru_ru: Цвет общего дохода

source: Shortcode Guide
ru_ru: Руководство по шорткодам

source: Below is a list of available shortcodes for the Calculator Framework plugin, along with their descriptions and usage instructions.
ru_ru: Ниже приведен список доступных шорткодов для плагина Calculator Framework, а также их описания и инструкции по использованию.

source: Available Shortcodes
ru_ru: Доступные шорткоды

source: Displays the Compound Interest Calculator. Use this shortcode to allow users to calculate compound interest with options for initial investment, interest rate, time, compounding frequency, and replenishment.
ru_ru: Отображает калькулятор сложных процентов. Используйте этот шорткод, чтобы пользователи могли рассчитать сложные проценты с параметрами начального вклада, процентной ставки, срока, периодичности начисления и пополнения.

source: Displays the Savings Calculator. Use this shortcode to allow users to calculate savings growth with options for initial investment, monthly deposits, interest rate, and time.
ru_ru: Отображает калькулятор сбережений. Используйте этот шорткод, чтобы пользователи могли рассчитать рост сбережений с параметрами начального вклада, ежемесячных взносов, процентной ставки и срока.

source: Example:
ru_ru: Пример:

source: Usage Instructions
ru_ru: Инструкции по использованию

source: 1. Insert the desired shortcode into any page or post where you want the calculator to appear.
ru_ru: 1. Вставьте нужный шорткод на любую страницу или запись, где вы хотите отобразить калькулятор.

source: 2. Ensure the calculator is enabled in the Calculator Framework Settings.
ru_ru: 2. Убедитесь, что калькулятор включен в настройках Calculator Framework.

source: 3. Customize the appearance and behavior of the calculators using the settings on the main settings page.
ru_ru: 3. Настройте внешний вид и поведение калькуляторов с помощью настроек на главной странице настроек.

source: Nonce verification failed
ru_ru: Проверка nonce не удалась

source: Invalid calculator module
ru_ru: Недопустимый модуль калькулятора

source: Year %d
ru_ru: Год %d

source: Deposit Calculator
ru_ru: Калькулятор вкладов

source: Deposit Amount
ru_ru: Сумма вклада

source: Final Amount
ru_ru: Сумма вклада с процентами

source: Accrued Interest
ru_ru: Начисленные проценты

source: Capital Growth
ru_ru: Прирост капитала

source: Term
ru_ru: Срок размещения

source: Term Unit
ru_ru: Единица отсчета

source: Month
ru_ru: Месяц

source: Start Date
ru_ru: Начало срока

source: Interest Rate (%)
ru_ru: Процентная ставка (%)

source: Capitalize Interest
ru_ru: Капитализация процентов

source: Capitalization of interest is a form of interest payment on a deposit where the accrued interest is added to the principal amount of the deposit, meaning the initial deposit is regularly increased by the amount of accrued interest, and subsequent interest is calculated on the increased amount.
ru_ru: Капитализация процентов – это форма выплаты дохода по вкладу, при которой начисленные проценты прилагаются к основной сумме депозита, то есть первоначальный взнос регулярно увеличивается на сумму начисленных процентов и последующее начисление происходит уже на увеличенную сумму.

source: Capitalization Frequency
ru_ru: Периодичность капитализации

source: Daily
ru_ru: Каждый день

source: At the End of Term
ru_ru: В конце срока

source: Replenishments and Withdrawals
ru_ru: Пополнения и снятия

source: Add Replenishment
ru_ru: Добавить пополнение

source: Add Withdrawal
ru_ru: Добавить снятие

source: One-Time
ru_ru: Разовое

source: Every 2 Months
ru_ru: Раз в 2 месяца

source: Semiannually
ru_ru: Раз в полгода

source: Replenishment Date
ru_ru: Дата пополнения

source: Withdrawal Frequency
ru_ru: Периодичность снятия

source: Withdrawal Date
ru_ru: Дата снятия

source: Withdrawal Amount
ru_ru: Сумма снятия

source: Cancel
ru_ru: Отменить

source: Add
ru_ru: Добавить

source: Transactions
ru_ru: Таблица начисления процентов

source: Type
ru_ru: Тип

source: Frequency
ru_ru: Периодичность

source: Date
ru_ru: Дата

source: Remove
ru_ru: Удалить

source: Replenishment
ru_ru: Пополнение

source: Withdrawal
ru_ru: Снятие

source: Deposit Summary
ru_ru: Сводка по вкладу

source: Interest Accrual Table
ru_ru: Таблица начисления процентов

source: Balance
ru_ru: Баланс

source: Months
ru_ru: Месяцев

source: Target Amount
ru_ru: Целевая сумма

source: Calculate By
ru_ru: Рассчитать по

source: Savings Period
ru_ru: Период накопления

source: Current Amount Saved
ru_ru: Накопленная на данный момент сумма

source: Monthly Investment
ru_ru: Сумма ежемесячных инвестиций

source: Expected Return (%)
ru_ru: Ожидаемая доходность (%)

source: Savings Summary
ru_ru: Сводка по накоплениям

source: Savings Growth Chart
ru_ru: График роста накоплений

source: Savings Table
ru_ru: Таблица накоплений

source: Investment
ru_ru: Инвестиции

source: Interest
ru_ru: Проценты

source: Required Investment
ru_ru: Необходимые инвестиции

source: Required Interest
ru_ru: Необходимые проценты

source: Required Total
ru_ru: Необходимая итоговая сумма

source: Investing %s per month is %s to reach the target amount.
ru_ru: Инвестируя %s в месяц %s для накопления целевой суммы.

source: insufficient
ru_ru: недостаточно

source: sufficient
ru_ru: достаточно

source: Goals Calculator
ru_ru: Калькулятор целей

source: Savings
ru_ru: Накопления

source: Passive Income
ru_ru: Пассивный доход

source: Desired Monthly Income
ru_ru: Желаемый пассивный доход в месяц

source: Number of Years
ru_ru: Количество лет

source: Average Annual Inflation Rate (%)
ru_ru: Среднегодовая ставка инфляции (%)

source: Average Annual Return Rate (%)
ru_ru: Среднегодовая ставка доходности (%)

source: Initial Capital Amount
ru_ru: Сумма стартового капитала

source: Savings Goal
ru_ru: Цель накоплений

source: Passive Income Goal
ru_ru: Цель пассивного дохода

source: With an annual return rate of
ru_ru: При годовой доходности ваших инвестиций

source: over
ru_ru: за

source: years, you will accumulate
ru_ru: лет вы накопите

source: To receive a monthly passive income of
ru_ru: Чтобы через

source: in
ru_ru: лет ежемесячно получать пассивный доход

source: years, you need to accumulate
ru_ru: вы должны накопить

source: Target Amount with Inflation
ru_ru: Сумма цели с учетом инфляции

source: Target Monthly Income with Inflation
ru_ru: Целевая ежемесячная доходность с учетом инфляции

source: Equivalent Today
ru_ru: Эквивалент на сегодняшний день

source: To Achieve Your Goal, You Need to Contribute:
ru_ru: Чтобы достигнуть цели, вам нужно вносить:

source: With this calculator, you can calculate how much money you need to invest or save to achieve any financial goal by a specific date.
ru_ru: С помощью калькулятора вы можете рассчитать, сколько денег нужно инвестировать или откладывать, чтобы достичь любой финансовой цели к определенному сроку.

source: Lump Sum
ru_ru: Единоразово

source: Goal Type
ru_ru: Тип цели

source: Desired Monthly Passive Income
ru_ru: Желаемый пассивный доход в месяц

source: Initial Capital
ru_ru: Сумма стартового капитала

source: Goal Results
ru_ru: Сумма стартового капитала

source: To achieve your goal in %years% years with a target of %target_amount%, you need to contribute:
ru_ru: Чтобы через %years% лет накопить %target_amount%, вам нужно вносить:

source: To achieve a monthly passive income of %monthly_income% in %years% years, you need to accumulate:
ru_ru: Чтобы через %years% лет ежемесячно получать пассивный доход %monthly_income%, вам нужно накопить:

source: Target with Inflation
ru_ru: Сумма цели с учетом инфляции

source: Displays the Goals Calculator. Use this shortcode to allow users to calculate the amount needed to achieve financial goals, either through savings or passive income, considering inflation, return rate, and initial capital.
ru_ru: Отображает калькулятор целей. Используйте этот шорткод, чтобы пользователи могли рассчитать сумму, необходимую для достижения финансовых целей, либо через накопления, либо через пассивный доход, с учетом инфляции, ставки доходности и начального капитала.
